//C++ 特別基本型別
//使用 gcc 編譯器

int V; //變數
int A[9]={}; //陣列
int F(int){return 0;} //函數

int*P; //指標
int*(pA[9]); //指標的陣列
int(*aP)[9]; //陣列的指標
int(*fP)(int); //函數的指標
int(*(fpA[9]))(int); //函數的指標的陣列
int(*((*fpaP)[9]))(int); //函數的指標的陣列的指標
int*(pF(int)); //傳出指標的函數
//int(aF(int))[9]; //傳出陣列的函數（錯誤：函數不能回傳陣列）
int(*(apF(int)))[9]; //傳出陣列的指標的函數
//int(fF(int))(int); //傳出函數的函數（錯誤：函數不能回傳函數）
int(*(fpF(int)))(int); //傳出函數的指標的函數
int(*((*fpfP)(int)))(int); //傳出函數指標的函數指標
int(*((*((*fpfpfP)(int)))(int)))(int); //傳出傳出函數指標的函數指標的函數指標
int(*((*((*((*((*((*((*((*((*((*fpfpfpfpfpfpfpfpfpfP)(int)))(int)))(int)))(int)))(int)))(int)))(int)))(int)))(int)))(int);
/*(傳出{傳出[傳出(傳出{傳出[傳出(傳出{傳出[傳出(
    函數指標
)的函數指標]的函數指標}的函數指標)的函數指標]的函數指標}的函數指標)的函數指標]的函數指標}的函數指標)*/

int(*((*(apfpA[9]))(int)))[9];   //傳出陣列的指標的函數指標的陣列
int(*((*((*((*((*apfpapfpaP)[9]))(int)))[9]))(int)))[9];
//傳出[傳出(陣列指標)的函數指標的陣列指標)的函數指標的陣列指標

int(*((*((*((*((*((*((*((*((*((*fpapfpapfpapfpapfpaP)[9]))(int)))[9]))(int)))[9]))(int)))[9]))(int)))[9]))(int);
//傳出[傳出(傳出{傳出[傳出(變數)的函數指標陣列指標]的函數指標陣列指標}的函數指標陣列指標)的函數指標陣列指標]的函數指標陣列指標

int**((*ppaP)[9]); //指標的指標的陣列的指標

int&R=V; //參考
int(&aR)[9]=A; //陣列的參考
int(&fR)(int)=F; //函數的參考

int main(){return 0;}